import 'package:places/domain/sight.dart';

List<Sight> mocks = [
  Sight(
    name: 'Кафедральный собор сошествия Святого Духа',
    lat: 53.905340,
    lon: 27.556094,
    url:
        'https://34travel.me/media/upload/images/2018/november/34dstpr/IMG_0249.jpg',
    type: 'Религия',
    details:
        'У Кафедрального собора очень насыщенное прошлое: в начале XVII века на его месте находился монастырь бернардинок, но примерно через сотню лет здание сгорело. К 1860 году его перестроили, но уже в качестве православной церкви.',
  ),
  Sight(
    name: 'Верхний город',
    lat: 53.903028,
    lon: 27.553011,
    url:
        'https://34travel.me/media/upload/images/2018/november/34dstpr/_MG_4318.jpg',
    type: 'Районы и улицы',
    details:
        'Исторические сердце Минска, плотненько наполненное аутентичной застройкой XVI – XIX веков. Тут тебе и тот самый главный Кафедральный собор, и площадь Свободы с городской Ратушей и костелом Святого Иосифа, и несколько прилегающих улочек – Революционная, Интернациональная,  Герцена и другие. Верхний город – пожалуй, самое туристическое место в городе, но его нежно любят и местные.',
  ),
  Sight(
    name: 'Костел Святых Сымона и Елены',
    lat: 53.896483,
    lon: 27.547591,
    url:
        'https://34travel.me/media/upload/images/2017/september/churches/new/IMG_8596.jpg',
    type: 'Религия',
    details:
        'Костел появился в Минске в 1910 году, и на то время – это был самый большой католический храм в городе с самой высокой башней. В советское время в здании храма располагались то театр, то киностудия «Советская Беларусь», то Дом кино. И лишь в 1990 году Костел святых Симона и Алены вернули католической общине – с тех пор в храме исправно проводят богослужения. ',
  ),
];
